Repository: is-project-4th-year/ShambaEye
Catalog: mobile/lib/l10n/app_*.arb
Languages: sw

source: Welcome back,
sw: Karibu tena,

source: Plant Enthusiast
sw: Mpenzi wa Mimea

source: BASIC
sw: MSINGI

source: Plant Health Analysis
sw: Uchambuzi wa Afya ya Mimea

# premium_description
source: Full access to AI-powered disease detection and analysis tools
sw: Ufikiaji kamili wa zana za AI za kugundua magonjwa

# basic_description
source: Upgrade to unlock severity analysis, heatmaps, and history
sw: Boresha ili kufungua uchambuzi wa ukali, ramani za joto na historia

source: Quick Scan
sw: Uchanganuzi wa Haraka

# quick_scan_sub
source: Start analyzing your plants
sw: Anza kuchanganua mimea yako

source: Camera
sw: Kamera

# take_photo
source: Take a photo
sw: Piga picha

source: Gallery
sw: Maktaba

# choose_photo
source: Choose from photos
sw: Chagua kutoka kwa picha

source: Features
sw: Vipengele

# features_unlocked
source: All features unlocked
sw: Vipengele vyote vimefunguliwa

# features_locked
source: Upgrade for more features
sw: Boresha ili kupata vipengele zaidi

source: Basic Detection
sw: Utambuzi wa Msingi

# basic_detection_desc
source: Essential disease identification
sw: Utambuzi muhimu wa magonjwa

source: Severity Analysis
sw: Uchambuzi wa Ukali

# severity_desc
source: Detailed disease assessment
sw: Tathmini ya kina ya ugonjwa

source: Heat Maps
sw: Ramani za Joto

# heatmaps_desc
source: Visual disease locations
sw: Maeneo yaliyoathirika

source: Analysis History
sw: Historia ya Uchambuzi

# analysis_history_desc
source: Track your plant health
sw: Fuata afya ya mimea yako

source: Cloud Storage
sw: Hifadhi Mtandaoni

# cloud_desc
source: Access anywhere, anytime
sw: Fikia popote, wakati wowote

source: Upgrade to unlock
sw: Boresha ili kufungua

source: English
sw: Kiingereza

# swahili
source: Swahili (Kiswahili)
sw: Kiswahili

source: System Default
sw: Chaguo la Mfumo

source: Analyze Plant
sw: Chambua Mmea

source: Scan History
sw: Historia ya Uchambuzi

source: Your plant analysis records
sw: Rekodi zako za uchambuzi wa mimea

source: Loading History
sw: Inapakia Historia

source: Fetching your scan records...
sw: Inakusanya rekodi zako za uchambuzi...

source: Unable to Load History
sw: Hawezi Kupakia Historia

source: No Scans Yet
sw: Hakuna Uchambuzi Bado

# your_plant_analysis_history_will_appear
source: Your plant analysis history will appear here after your first scan
sw: Historia yako ya uchambuzi wa mimea itaonekana hapa baada ya uchambuzi wako wa kwanza

source: Start Your First Scan
sw: Anza Uchambuzi Wako wa Kwanza

# use_the_camera_button_below
source: Use the camera button below to start scanning!
sw: Tumia kifungo cha kamera hapa chini kuanza kuchambua!

source: Recent Scans
sw: Uchambuzi wa Hivi Karibuni

source: View Details
sw: Angalia Maelezo

source: Delete Scan?
sw: Futa Uchambuzi?

# this_will_permanently_delete
source: This will permanently delete the scan for "{disease}" from your history.
sw: Hii itafuta kwa umiliki uchambuzi wa "{disease}" kutoka kwenye historia yako.

source: CANCEL
sw: SITASHA

source: DELETE
sw: FUTA

source: Close
sw: Funga

source: Image Analysis
sw: Uchambuzi wa Picha

source: Original
sw: Asili

source: Heatmap
sw: Ramani ya Joto

source: Scan Details
sw: Maelezo ya Uchambuzi

source: Severity
sw: Ukali

source: Analysis Mode
sw: Hali ya Uchambuzi

source: Treatment Advice
sw: Ushauri wa Matibabu

source: Not available
sw: Haipatikani

source: Image unavailable
sw: Picha haipatikani

source: Language
sw: Lugha

# language_preference_saved
source: Your language preference will be saved to your account
sw: Lugha yako itahifadhiwa kwenye akaunti yako

source: Feature coming soon!
sw: Kipengele kinakuja hivi karibuni!

source: Profile
sw: Wasifu

source: Manage your account and preferences
sw: Dhibiti akaunti yako na mapendeleo

source: Edit Profile
sw: Hariri Wasifu

source: No Profile Found
sw: Hakuna Wasifu Ulipatikana

source: Please log in to view your profile
sw: Tafadhali ingia ili kuona wasifu wako

source: Farm Overview
sw: Muhtasari wa Shamba

source: Farm Size
sw: Ukubwa wa Shamba

source: acres
sw: ekari

source: Status
sw: Hali

source: Active
sw: Inatumika

source: Profile Details
sw: Maelezo ya Wasifu

source: Edit your information
sw: Hariri maelezo yako

source: Your personal details
sw: Maelezo yako binafsi

source: Full Name
sw: Jina Kamili

source: Email
sw: Barua Pepe

source: Location
sw: Eneo

source: Please enter your full name
sw: Tafadhali ingiza jina lako kamili

source: Please enter your location
sw: Tafadhali ingiza eneo lako

source: Please enter farm size
sw: Tafadhali ingiza ukubwa wa shamba

source: Please enter a valid farm size
sw: Tafadhali ingiza ukubwa halali wa shamba

source: Preferred Language
sw: Lugha Unayopendelea

source: Save Changes
sw: Hifadhi Mabadiliko

source: Logout
sw: Toka

source: Login
sw: Ingia

# logout_question
source: Logout?
sw: Toka?

source: Are you sure you want to logout?
sw: Una uhakika unataka kutoka?

source: Profile updated successfully!
sw: Wasifu umesasishwa kikamilifu!

source: Failed to update profile
sw: Imeshindwa kusasisha wasifu

# capture_upload_description
source: Capture or upload an image of your plant leaf for instant AI-powered disease detection and treatment recommendations
sw: Piga picha au pakia picha ya jani la mmea wako kwa utambuzi wa magonjwa unaotumia AI na mapendekezo ya matibabu

source: Select Image Source
sw: Chagua Chanzo cha Picha

# choose_how_to_capture
source: Choose how you want to capture the image
sw: Chagua jinsi unavyotaka kupiga picha

source: Take a photo
sw: Piga picha

source: Choose from photos
sw: Chagua kutoka kwa picha

source: How It Works
sw: Inafanyaje Kazi

# simple_steps
source: Simple steps to analyze your plant health
sw: Hatua rahisi za kuchambua afya ya mmea wako

source: Capture Image
sw: Piga Picha

# take_clear_photo
source: Take a clear photo of the plant leaf
sw: Piga picha wazi ya jani la mmea

source: AI Analysis
sw: Uchambuzi wa AI

# advanced_detection
source: Advanced detection with high accuracy
sw: Utambuzi wa hali ya juu na usahihi mkubwa

source: Get Treatment
sw: Pata Matibabu

# personalized_recommendations
source: Personalized treatment recommendations
sw: Mapendekezo ya matibabu yanayofaa

source: Detailed Insights
sw: Ufahamu wa Kinaganaga

# severity_assessment
source: Severity assessment and prevention tips
sw: Tathmini ya ukali na vidokezo vya kuzuia

source: Retake
sw: Piga Upya

source: Choose Another
sw: Chagua Nyingine

source: Analyzing Image
sw: Inachambua Picha

source: Processing your plant image...
sw: Inachakata picha yako ya mmea...

source: Analysis Failed
sw: Uchambuzi Umeshindwa

source: Try Again
sw: Jaribu Tena

source: Ready for Analysis
sw: Tayari kwa Uchambuzi

source: Basic Analysis Ready
sw: Uchambuzi wa Msingi Tayari

# tap_below_for_full_ai_analysis
source: Tap below for full AI analysis with severity assessment
sw: Gusa hapa chini kwa uchambuzi kamili wa AI na tathmini ya ukali

source: Basic disease detection available
sw: Ugunduzi wa msingi wa magonjwa unapatikana

source: Analyze Online
sw: Chambua Mtandaoni

source: Analyze Offline
sw: Chambua Nje ya Mtandao

source: Login for advanced features
sw: Ingia kwa vipengele vya hali ya juu

source: Disease Visualization
sw: Uoneshaji wa Ugonjwa

# heatmap_showing_affected_areas
source: Heatmap showing affected areas (red indicates high disease concentration)
sw: Ramani ya joto inayoonyesha maeneo yaliyoathirika (nyekundu inaonyesha mkusanyiko wa juu wa ugonjwa)

source: Detailed View
sw: Mtazamo wa kina

source: Heatmap not available
sw: Ramani ya joto haipatikani

source: Online Analysis
sw: Uchambuzi wa Mtandaoni

source: Offline Analysis
sw: Uchambuzi Nje ya Mtandao

source: Analysis Results
sw: Matokeo ya Uchambuzi

source: Disease Detection
sw: Ugunduzi wa Ugonjwa

source: Disease
sw: Ugonjwa

source: Confidence
sw: Uthibitisho

source: New Analysis
sw: Uchambuzi Mpya

source: Share Results
sw: Shiriki Matokeo

# login_for_full_features
source: Login for full features: severity analysis, heatmaps, and cloud storage
sw: Ingia kwa vipengele kamili: uchambuzi wa ukali, ramani za joto na hifadhi ya wingu

source: General Advice
sw: Ushauri wa Jumla

source: Organic Treatment
sw: Matibabu ya Kiasili

source: Chemical Treatment
sw: Matibabu ya Kemikali

source: Prevention
sw: Kinga

source: Advice
sw: Ushauri

# no_specific_treatment_advice
source: No specific treatment advice available
sw: Hakuna ushauri maalum wa matibabu unaopatikana
